OpenFOAM-v2112-AD/tutorials/multiphase/interIsoFoam/iobasin/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 0
);

regions
(
    boxToCell
    {
        box (-1e10 -1e10 -1e10) (1e10 1e10 0.45);
        fieldValues
        (
            volScalarFieldValue alpha.water 1
        );
    }

    boxToCell
    {
        box (-1e10 -1e10 -1e10) (-0.2 1e10 1e10);
        fieldValues
        (
            volScalarFieldValue alpha.water 1
        );
    }

);


// ************************************************************************* //
